<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class HospitalsSeeder extends Seeder
{
    public function run(): void
    {
        $hospitals = [
            'عين شمس الباطنة' => [
                '5 باطنة',
                '6 باطنة',
                'زرع النخاع',
                'قسم ورعاية الصدر',
                'باطنة 2',
                'الروماتيزم',
                'درجات باطنة',
                'مجمع الرعايات',
                '12 باطنة',
                'أمراض الدم',
                'قسم الموضعة',
                'الطب الطبيعي',
                'قسم الجلدية',
                'الكلى الصناعي',
                'قسم القلب والرعاية المركزة',
                'باطنة 1',
                'أعصاب باطنة',
                'السكتة الدماغية',
                'المعامل الرئيسية',
                'رعاية أمراض الدم',
                'زرع النخاع الذاتى',
                'فصل بلازما'
            ],
            'مستشفى الأطفال' => [
                'الداخلي',
                'الدم والأورام',
                'الكلى الصناعي',
                'الرعاية المركزة',
                'الجراحة',
                'المحضن',
                'الأعصاب',
                'الجهاز الهضمي',
                'القىء الدموي',
                'الحساسية والمناعة',
                'الأشعة',
                'مناظير الصدر',
                'عيادة السكر',
                'عيادة الكلى',
                'قسطرة القلب'
            ],
            'مستشفى النساء والتوليد' => [
                'الرعاية / أورام النسا',
                'رعاية الجنين وأمراض قاع الحوض',
                'صرف علاج',
                'المحضن',
                'الداخلي',
                'التشخيص المبكر للأورام والمناظير النسائية',
                'جراحة أورام'
            ],
            'باقي المستشفيات' => [
                'الدمرداش الجراحي',
                'الليزر',
                'الباثولوجي',
                'أمراض وجراحات القلب',
                'المسنين',
                'الطوارئ الجديدة',
                'الأورام',
                'الطب النفسي',
                'مناظير الجهاز الهضمي',
                'السموم',
                'الوراثة',
                'العبور'
            ],
            'مستشفى الأشعة' => [
                'أشعة تشخيصية',
                'أشعة مقطعية',
                'المسح الذري',
                'رنين مغناطيسي'
            ],
            'العيادات' => [
                'الطب الطبيعي',
                'السمعيات',
                ' والأشعة فوق البنفسجية',
                'أشعة الرمد',
                'الحملة الرئاسية'
            ]
        ];

        foreach ($hospitals as $hospitalName => $departments) {
            $hospitalId = DB::table('hospitals')->insertGetId([
                'name' => $hospitalName,
                'created_at' => now(),
                'updated_at' => now(),
            ]);

            foreach ($departments as $dept) {
                DB::table('departments')->insert([
                    'hospital_id' => $hospitalId,
                    'name' => $dept,
                    'created_at' => now(),
                    'updated_at' => now(),
                ]);
            }
        }
    }
}
